// KnifeData.h: interface for the CKnifeData class.
//
//////////////////////////////////////////////////////////////////////

#if !defined(AFX_KNIFEDATA_H__A728516D_A58B_4CCE_A989_BDBF092CD9D5__INCLUDED_)
#define AFX_KNIFEDATA_H__A728516D_A58B_4CCE_A989_BDBF092CD9D5__INCLUDED_

#if _MSC_VER > 1000
#pragma once
#endif // _MSC_VER > 1000

typedef struct S_Slope
{                        //////刀具C功能补偿时 曲线斜率结构体
	int    G;            //何种平面下的刀补 0－XY平面，1－ZX平面，2－YZ平面
	double Xl;           //X轴方向分量
	double Yl;           //Y轴方向分量RTNDATA
	double Zl;           //Z轴方向分量
}S_Slope;

typedef struct JOIN
{
	int    number;        //转出来的轨迹点数
	int    type0;         //0:G00  1:G01  2:G02  3:G03
	int    g0;            //0:G17  1:G18  2:G19
	double x0;            //X轴坐标值
	double y0;            //Y轴坐标值
	double z0;            //Z轴坐标值
	double i0;            //I轴坐标值
	double j0;            //J轴坐标值
	double k0;            //K轴坐标值
	int    type1;         //0:G00  1:G01  2:G02  3:G03
	int    g1;            //0:G17  1:G18  2:G19
	double x1;            //X轴坐标值
	double y1;            //Y轴坐标值
	double z1;            //Z轴坐标值
	double i1;            //I轴坐标值
	double j1;            //J轴坐标值
	double k1;            //K轴坐标值
	int    type2;         //0:G00  1:G01  2:G02  3:G03
	int    g2;            //0:G17  1:G18  2:G19
	double x2;            //X轴坐标值
	double y2;            //Y轴坐标值
	double z2;            //Z轴坐标值
	double i2;            //I轴坐标值
	double j2;            //J轴坐标值
	double k2;            //K轴坐标值
	int    type3;         //0:G00  1:G01  2:G02  3:G03
	int    g3;            //0:G17  1:G18  2:G19
	double x3;            //X轴坐标值
	double y3;            //Y轴坐标值
	double z3;            //Z轴坐标值
	double i3;            //I轴坐标值
	double j3;            //J轴坐标值
	double k3;            //K轴坐标值
}JOIN;
struct tag2DPoint
{
	double x;
	double y;
}; 
typedef struct tag2DPoint Point2D,*pPoint2D;
struct tag3DPoint
{
	double x;
	double y;
	double z;
}; 
typedef struct tag3DPoint Point3D;
typedef struct tagKERFDATA
{
	Point3D		PointGrid;
	Point3D		PointPara;	/* 鼠标记录的位置 */
} KERFDATA, *PKERFDATA;


class AFX_EXT_CLASS CKnifeData : public CObject  
{
public:
	CKnifeData();
	virtual ~CKnifeData();

//接口指针	   
    /*******************************************************************************************
    函数名称: 
    描    述: G代码解析完的数据结构附给C-刀补库
    输入参数: (PGRAPHLIST)数据结构的指针;dKnife刀补值	
    输出参数: 无
    返    回: 无
	********************************************************************************************/
	int Knife_SetGraphData(long lData,double dKnife);	

   /*******************************************************************************************
    函数名称: 
    描    述: 返回刀补计算以后的结构体指针
    输入参数: 	
    输出参数: 无
    返    回: (PGRAPHLIST)数据结构的指针
	********************************************************************************************/
	long Knife_GetGraphFinishData();

   /*******************************************************************************************
    函数名称: 
    描    述: 刀补计算前计算最大刀补值，针对圆弧半径
    输入参数: 	
    输出参数: 无
    返    回: 整个图形的插补最大值
	********************************************************************************************/
	double Knife_CalMaxTool();

	
private:
	PGRAPHLIST m_pListGraph;//保存原始的加工链表

  	PGRAPHLIST m_pListGraphFinish;//保存转换完的加工链表

	double m_dKnifeValue;
  /*******************************************************************************************
    函数名称: 
    描    述: C-刀补转换
    输入参数: 	
    输出参数: 无
    返    回: 无
	********************************************************************************************/
	int ConvertToKnife();

   /*******************************************************************************************
    函数名称: 
    描    述: 释放刀补以后的数据链表m_pListGraphFinish
    输入参数: 	
    输出参数: 无
    返    回: 无
	********************************************************************************************/	
    void FreeKnifeData();

   /*******************************************************************************************
    函数名称: 
    描    述: 计算曲线斜率
    输入参数: G＝0－－－G17，1－－G18，2－－G19；
	          Graph 这个曲线的参数；
			  circle＝0－－直线，circle＝1－－圆弧起点斜率，2－－圆弧终点斜率；
    输出参数: 无
    返    回: S_Slope曲线斜率的结构体；
	********************************************************************************************/
	S_Slope Cal_Slope(int G,PGRAPH Graph,int circle);

	/*******************************************************************************************
    函数名称: 
    描    述: 计算曲线斜率
    输入参数: G4x  =0――左补偿， ＝1－－右补偿；
			  slope0――当前运行曲线，slope1――下一段运行曲线
			  d－－刀具半径；
			  pGraph--本插补数据 
    输出参数: 无
    返    回: 0－－－缩短形，1－－－伸长形，2－－插入形 -1计算错误；
	********************************************************************************************/
	int Find_JoinType(int G4x,S_Slope slope0,S_Slope slope1,double d,PGRAPH pGraph);


	/*******************************************************************************************
    函数名称: 
    描    述: 计算出刀具补偿代码
    输入参数: G4x＝41－－左刀补（G41），42――右刀补（G42）
	          pGraph――当前运动曲线
			  pGraphNext――下一运动曲线
              d－－刀具半径；
    输出参数: 无
    返    回: 刀补接点值；
	********************************************************************************************/
    JOIN Cal_JoinPoint(int G4x,PGRAPH pGraph,PGRAPH pGraphNext,double d);

	/*******************************************************************************************
    函数名称: 
    描    述: 计算直线接直线的刀补接点
    输入参数: Join_Type 交接类型
			  slope1――当前运行曲线，slope2――下一段运行曲线
	          pGraph――当前运动曲线			  
              d－－刀具半径；
    输出参数: 无
    返    回: 刀补接点值；
	********************************************************************************************/
    JOIN Cal_LineToLine(int Join_Type,S_Slope slope1,S_Slope slope2,PGRAPH pGraph,double d);

	/*******************************************************************************************
    函数名称: 
    描    述: 计算圆弧插补的最大值
    输入参数: pGraph――当前运动曲线;nKerfComp--刀补类型0左刀补,1右刀补;d--刀补值
    输出参数: 无
    返    回: 插补的最大值；
	********************************************************************************************/
	double Cal_RadiusToolSize(PGRAPH pGraph, int nKerfComp, double d);

	/*******************************************************************************************
    函数名称: 
    描    述: 增加一个Graph数据
    输入参数: 
    输出参数: 无
    返    回: 增加的指针
	********************************************************************************************/
	PGRAPH AddGraphData();

	/*******************************************************************************************
	函数名称: 
	描    述: 增加一个CADDATA数据
	输入参数: 
	输出参数: 无
	返    回: 增加的指针
	********************************************************************************************/
	PCADDATA AddCadData();

	/*******************************************************************************************
    函数名称: 
    描    述: 计算直线接圆弧的刀补接点
    输入参数: nGx-41左补；42右补
	          Join_Type 交接类型
			  slope1――当前运行曲线，slope2――下一段运行曲线
	          pGraph――当前运动曲线			  
              d－－刀具半径；
    输出参数: 无
    返    回: 刀补接点值；
	********************************************************************************************/
    JOIN Cal_LineToCircle(int nG4x,int Join_Type,S_Slope slope1,S_Slope slope2,PGRAPH pGraph,double d);

	/*******************************************************************************************
    函数名称: 
    描    述: 计算直线接圆弧的交点
    输入参数: pGraphLine――当前运动曲线			  
              pGraphCircle――下一运动曲线
    输出参数: 无
    返    回: 直线和圆弧的交点；
	********************************************************************************************/
    KERFDATA CalculateLineArcIntersection(PGRAPH pGraphLine, PGRAPH pGraphCircle);

	/*******************************************************************************************
    函数名称: 
    描    述: 获取补偿后的线段的起点，终点
    输入参数: G4x：41左补，42右补			  
              dToolSize：刀补值
			  LineBegin：起点坐标
              LineEnd：终点坐标
    输出参数: 无
    返    回: 补偿后的线段的起点，终点
	********************************************************************************************/
	KERFDATA GetCompPoint(int nG4x, double dToolSize, Point2D LineBegin, Point2D LineEnd);

	/*******************************************************************************************
    函数名称: 
    描    述: 圆弧插补获取补偿后的半径
    输入参数: nG4x：41左补，42右补			  
              dToolSize：刀补值
			  pGraphCircle圆弧插补
    输出参数: 无
    返    回: 补偿后的线段的起点，终点
	********************************************************************************************/
	double GetCompRadius(int nG4x, double dToolSize, PGRAPH pGraphCircle);

	/*******************************************************************************************
    函数名称: 
    描    述: 计算直线、圆弧交点,刀补偏移以后的插补的交点
    输入参数: LineBegin--起点坐标			  
              LineEnd--终点坐标
			  ArcCenter--圆心坐标
			  dRadius--半径
    输出参数: 无
    返    回: 交点坐标
	********************************************************************************************/
   KERFDATA CalculateLineArcIntersection(Point2D LineBegin, Point2D LineEnd, Point2D ArcCenter,double dRadius);

   /*******************************************************************************************
   函数名称: 
	描    述: 比较两交点的方位
	输入参数: PointA--刀补前的两交点			  
          PointB--刀补后的两交点  
	输出参数: 无
	返    回: 
	********************************************************************************************/
	void CompareIntersection(KERFDATA &PointA, KERFDATA &PointB);

	/*******************************************************************************************
	函数名称: 
	描    述: 增加一个Arc数据
	输入参数: 
	输出参数: 无
	返    回: 增加的指针
	********************************************************************************************/
	PARCINFO AddArcData();

	/*******************************************************************************************
	函数名称: 
	描    述: 有圆弧的点信息得到角度信息
	输入参数: pGraphCircle--圆弧的数据结构, dAngle刀补前数据转过的角度      
	输出参数: PARCINFO信息
	返    回: 
	********************************************************************************************/
	void CalDmcArc(PGRAPH pGraphCircle,double dAngle);
	
	/*******************************************************************************************
	函数名称: 
	描    述: 计算弧的夹角
	输入参数: nDirection--DIRECTION_CW顺时针，DIRECTION_CCW逆时针 
	          dAngleBegin--起始角
              dAngleEnd----终止角
	输出参数: 夹角
	返    回: 
	********************************************************************************************/
	double CalculateTraverseAngle(int nDirection, double dAngleBegin, double dAngleEnd);

	/*******************************************************************************************
    函数名称: 
    描    述: 圆弧首端切线与X轴的夹角
    输入参数: pGraph--插补线段              
    输出参数: 夹角
    返    回: 
    ********************************************************************************************/
    double ArcIncomingAngle(PGRAPH pGraph);

	/*******************************************************************************************
    函数名称: 
    描    述: 圆弧末端反向切线与X轴的夹角
    输入参数: pGraph--插补线段              
    输出参数: 夹角
    返    回: 
    ********************************************************************************************/
    double ArcOutgoingAngle(PGRAPH pGraph);

	/*******************************************************************************************
    函数名称: 
    描    述: 计算圆弧接直线的刀补接点
    输入参数: nGx-41左补；42右补
	          Join_Type 交接类型
			  slope1――当前运行曲线，slope2――下一段运行曲线
	          pGraph――当前运动曲线			  
              d－－刀具半径；
    输出参数: 无
    返    回: 刀补接点值；
	********************************************************************************************/
    JOIN Cal_CircleToLine(int nG4x,int Join_Type,S_Slope slope1,S_Slope slope2,PGRAPH pGraph,double d);

	/*******************************************************************************************
    函数名称: 
    描    述: 计算圆弧接圆弧的刀补接点
    输入参数: nGx-41左补；42右补
	          Join_Type 交接类型
			  slope1――当前运行曲线，slope2――下一段运行曲线
	          pGraph――当前运动曲线			  
              d－－刀具半径；
    输出参数: 无
    返    回: 刀补接点值；
	********************************************************************************************/
    JOIN Cal_CircleToCircle(int nG4x,int Join_Type,S_Slope slope1,S_Slope slope2,PGRAPH pGraph,double d);

	/*******************************************************************************************
    函数名称: 
    描    述: 计算两圆交点
    输入参数: CenterA--x/y圆心坐标，z--半径
	          CenterA--x/y圆心坐标，z--半径
			  dAngle--第二圆的起始角度，两圆同心时使用          			              
    输出参数: 无
    返    回: 圆的交点坐标；
	********************************************************************************************/
	KERFDATA CalculateArcIntersection(DOUBLEPOINT CenterA, DOUBLEPOINT CenterB, double dAngle);

};

#endif // !defined(AFX_KNIFEDATA_H__A728516D_A58B_4CCE_A989_BDBF092CD9D5__INCLUDED_)
